Table of Contents
 Interface IInternalForcesImporter<T>
Namespace
IdeaStatiCa.BimApiLink.Results
Assembly
IdeaStatiCa.BimApiLink.dll
public interface IInternalForcesImporter<T> where T : IIdeaObjectWithResults
Type Parameters
T
Methods
 GetResults(IReadOnlyList<T>)
IEnumerable<ResultsData<T>> GetResults(IReadOnlyList<T> objects)
Parameters
objects IReadOnlyList<T>
Returns
IEnumerable<ResultsData<T>>
 Edit this page